[
  {
    "title": "Story: How I Created Loan Note",
    "date": "2025-01-31",
    "slug": "2025-01-31",
    "excerpt": "I kept forgetting who I owed and how much I’d already paid back, so I started scribbling notes and spreadsheets. That quickly got messy, and I wanted something I could open on my phone and update in seconds.",
    "body": "I kept forgetting who I owed and how much I’d already paid back, so I started scribbling notes and spreadsheets. That quickly got messy, and I wanted something I could open on my phone and update in seconds. I decided to build a small web app: a place to create “loans,” add amounts and labels, and see totals update automatically.\n\nI built it with PHP and a simple database so I could host it myself and keep full control of the data. I started with the basics: registration and login, a dashboard showing a grand total, and loan detail pages where entries can be marked as paid. From there, I added currency settings so it works across different countries, and a profile system where users can set a name and username.\n\nTo help new users get started quickly, I wrote a short user guide that explains how to register, track loans, and use the app’s main features.\n\nLoan Note is the app I use to stop losing track of who owes what—and the one I built step by step to solve that exact problem."
  },
  {
    "title": "Favorite Films That Made an Impression",
    "date": "2025-01-18",
    "slug": "2025-01-18",
    "excerpt": "I've watched a lot of films, but a few stick with me long after the credits roll. Here are some of the ones that really made an impression and why I keep coming back to them.",
    "body": "I've watched a lot of films, but a few stick with me long after the credits roll. The ones that really made an impression are usually the ones that understand human nature in some way—they don't need to be about grand adventures or impossible stakes. Sometimes the smallest moments say the most.\n\nI love films that trust the audience to understand subtext, that don't explain every detail, and that leave room for interpretation. I also appreciate films that are just fun and don't pretend to be more than they are. A great comedy, a solid heist movie, a well-made thriller—they all have their place.\n\nThe best part of being into movies is discovering something new, even if it's old. There are always more films to watch, more stories to experience, and more reasons to appreciate good storytelling in any form."
  },
  {
    "title": "Learning from Mistakes in Dota 2",
    "date": "2025-01-12",
    "slug": "2025-01-12",
    "excerpt": "Playing Dota has taught me a lot about recognizing patterns, making split-second decisions, and handling frustration. Every loss is a chance to learn something, and the best part is how the community helps you improve.",
    "body": "Playing Dota has taught me a lot about recognizing patterns, making split-second decisions, and handling frustration. I've been in Herald for a while, and I'm okay with that. The goal isn't to climb the ranks as fast as possible—it's to improve a little each game.\n\nEvery loss is a chance to learn something. Did I get caught out of position? Did I miss a spell? Did I not communicate with my team? The game is complex enough that there's always something to work on. And unlike some competitive games, the Dota community is generally helpful when you ask for advice.\n\nWhat keeps me coming back is that feeling when you coordinate perfectly with your team and pull off something you weren't sure was possible. Those moments are rare, but they're worth all the chaotic games in between."
  }
]
